kinetic-monte-carlo-method-project/modelo/notas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-24 sex 11:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Decomposição elétrica do TiS3 em condições ambientais</title>
<meta name="author" content="Filipe Gonçalves Jacinto" />
<meta name="description" content="Projeto que mostra que a perda de Enxofre(S) desempenha um papel importante na decomposição elétrica do TiS3 em condições ambientais" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Decomposição elétrica do TiS3 em condições ambientais</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc8b36fe">1. Introdução:</a>
<ul>
<li><a href="#org1b53491">1.1. Pontos positivos do TiS3:</a></li>
<li><a href="#org0b429df">1.2. Problema do paper: Calcular a decomposição elétrica do TiS3</a>
<ul>
<li><a href="#org1c7c638">1.2.1. Resultados:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3bbfaaf">2. Estrutura do código:</a>
<ul>
<li><a href="#org3c10aa5">2.1. Funcoes.py</a>
<ul>
<li><a href="#org9c795c2">2.1.1. Gamma:</a></li>
<li><a href="#org4586a5b">2.1.2. R<sub>sum</sub>:</a></li>
<li><a href="#org4137073">2.1.3. Probable<sub>event</sub>:</a></li>
<li><a href="#org6b1f4f9">2.1.4. Time<sub>foward</sub>:</a></li>
</ul>
</li>
<li><a href="#orgd288ef7">2.2. Main.py:</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgc8b36fe" class="outline-2">
<h2 id="orgc8b36fe"><span class="section-number-2">1.</span> Introdução:</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1b53491" class="outline-3">
<h3 id="org1b53491"><span class="section-number-3">1.1.</span> Pontos positivos do TiS3:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Possível substituto do Silício</li>
<li>Bandgap de 1.0 eV</li>
<li>Pode ser isolado em monocamada e nanotubos</li>
</ul>
</div>
</div>
<div id="outline-container-org0b429df" class="outline-3">
<h3 id="org0b429df"><span class="section-number-3">1.2.</span> Problema do paper: Calcular a decomposição elétrica do TiS3</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org1c7c638" class="outline-4">
<h4 id="org1c7c638"><span class="section-number-4">1.2.1.</span> Resultados:</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>A decomposição elétrica é causada tanto por efeito Joule</li>
<li>A decomposição elétrica também é causada por formação de vacâncias , mesmo que a energia de ativação da reação seja alta para um único átomo de S</li>
<li>O teste com atmosfera rica em Oxigênio mostra que a energia de formação de defeitos cai significativamente quando se retira uma dupla de átomos SO comparado a um átomo de S sozinho</li>
<li>DFT + Monte Carlo cinético sugerem que a formação de vacâncias é devida à oxidação do material seguida da dessorção dos átomos de enxofre</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org3bbfaaf" class="outline-2">
<h2 id="org3bbfaaf"><span class="section-number-2">2.</span> Estrutura do código:</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3c10aa5" class="outline-3">
<h3 id="org3c10aa5"><span class="section-number-3">2.1.</span> Funcoes.py</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org9c795c2" class="outline-4">
<h4 id="org9c795c2"><span class="section-number-4">2.1.1.</span> Gamma:</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Faz o cálculo de Gamma[i] cálculo de Gamma</li>
</ul>
</div>
</div>
<div id="outline-container-org4586a5b" class="outline-4">
<h4 id="org4586a5b"><span class="section-number-4">2.1.2.</span> R<sub>sum</sub>:</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Cálcula R<sub>i</sub>[i]</li>
<li>Soma os termos de R<sub>i</sub>[i]</li>
</ul>
</div>
</div>
<div id="outline-container-org4137073" class="outline-4">
<h4 id="org4137073"><span class="section-number-4">2.1.3.</span> Probable<sub>event</sub>:</h4>
</div>
<div id="outline-container-org6b1f4f9" class="outline-4">
<h4 id="org6b1f4f9"><span class="section-number-4">2.1.4.</span> Time<sub>foward</sub>:</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>Cálcula o time<sub>step</sub> (intervalo do evento) e o adiciona ao contador de tempo(t)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd288ef7" class="outline-3">
<h3 id="orgd288ef7"><span class="section-number-3">2.2.</span> Main.py:</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Este código é dividido em três partes:
<ol class="org-ol">
<li>A primeira parte declara as variáveis e arrays necessários nesse algoritmo em específicos:

<ul class="org-ul">
<li><b>Variáveis</b>
<ul class="org-ul">
<li>gamma<sub>zero</sub></li>
<li>temperatura</li>
<li>t (tempo)</li>
</ul></li>
<li><b>Arrays</b>
<ul class="org-ul">
<li>Delta (energias de ativação)</li>
<li>N (número de particulas que realizaram o evento )</li>
</ul></li>
<li><b>Empty Arrays</b>
<ul class="org-ul">
<li>time (armazena os tempos calculados em cada iteração)</li>
<li>rate (armazera a soma R<sub>n</sub> ao longo do tempo)</li>
</ul></li>
</ul></li>

<li>Esta parte é onde está estruturado a ordem do algoritmo utilizando as funções definidas em Funcoes.py

<ul class="org-ul">
<li>O algoritmo segue a seguinte forma:
<ol class="org-ol">
<li><b>Gamma()</b> , calcula gamma</li>
<li>For in range(numero de iterações necessárias)
<ul class="org-ul">
<li>Lista de eventos dentro do for:
<ol class="org-ol">
<li><b>R<sub>sum</sub>()</b></li>
<li><b>Probable Event()</b></li>
<li><b>Time Foward</b></li>
<li>Adicionamos o termo no array de <b>time</b></li>
<li>Adicionamos o termo no array de <b>rate</b></li>
</ol></li>
</ul></li>
</ol></li>
</ul></li>
<li>A parte final do algoritmo consiste em plotar/calcular quantidades que ajudem a compreender o problema :
<ol class="org-ol">
<li>Plot de gráfico utilzando o pacote matplotlib</li>
</ol></li>
</ol></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Filipe Gonçalves Jacinto</p>
<p class="date">Created: 2021-09-24 sex 11:05</p>
</div>
</body>
</html>
